    /* Задача 1. Напишите программу, которая на вход принимает два числа и выдаёт,
    какое число большее, а какое меньшее.*/

/*Console.Write ("Enter the first namber: ");
int firstNamber = Convert.ToInt32 (Console.ReadLine());
Console.Write ("Enter the second namber: ");
int secondNamber = Convert.ToInt32 (Console.ReadLine());
    if (firstNamber>secondNamber)
        Console.WriteLine("Your first number is greater than the second");
    else
        if (firstNamber==secondNamber)
            Console.WriteLine("Your numbers are equal");    
        else
            Console.WriteLine("Your second namber is greater than the first");*/
    
        
    /* Задача 2. Напишите программу, которая принимает на вход три числа и выдаёт
    максимальное из этих чисел.*/

/*Console.Write ("Enter the first namber: ");
int firstNamber = Convert.ToInt32 (Console.ReadLine());
Console.Write ("Enter the second namber: ");
int secondNamber = Convert.ToInt32 (Console.ReadLine());
Console.Write ("Enter the third namber: ");
int thirdNamber = Convert.ToInt32 (Console.ReadLine());
int max = 0;
    if (firstNamber>secondNamber)
        max = firstNamber;
    else
        if (secondNamber>thirdNamber)
            max = secondNamber;
        else
            if (firstNamber<thirdNamber)
                max = thirdNamber;

Console.WriteLine("The largest namber is " + max);*/
        
     
     /* Задача 3. Напишите программу, которая на вход принимает число и выдаёт,
    является ли число чётным (делится ли оно на два без остатка).*/

/*int rem = 0;
Console.Write ("Enter the namber: ");
int namber = Convert.ToInt32(Console.ReadLine());
rem =  namber % 2;
    if (rem==0)
        Console.WriteLine("The namber is even");
    else
        Console.WriteLine ("The namber is not even");*/


    /* Задача 4. Напишите программу, которая на вход принимает число (N),
    а на выходе показывает все чётные числа от 1 до N.*/