/*Задача 1. Напишите программу, которая принимает на вход число и проверяет,
 является ли оно палиндромом.*/
/*
int result = 0;
int reversNumber (int number)
{   
    while (number > 0)
        {
           int reminder = number % 10;
            number = number / 10;
            result = result * 10 + reminder;
        }
    int finResult = result;
    return finResult;
}
 
Console.Write("Enter a number: ");
int number = Convert.ToInt32(Console.ReadLine());
int oper = number;
    
    if (oper == reversNumber(number)) 
        Console.WriteLine("Your number is a palindrome.");
    else
        Console.WriteLine("Your number is not a palindrome.");
*/
        
        

/*Задача 2. Напишите программу, которая принимает на вход координаты двух точек и находит
  расстояние между ними в 3D пространстве.*/




/*Задача 3. Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов
  чисел от 1 до N.*/